xml4test/TRANS.xml

<ns1:Envelope xmlns:ns1="http://schemas.xmlsoap.org/soap/envelope/"><ns1:Body><ns2:SendRequestRequest xmlns:ns2="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/1.1"><ns2:SenderProvidedRequestData Id="SIGNED_BY_CONSUMER"><ns2:MessageID>db0486d0-3c08-11e5-95e2-d4c9eff07b77</ns2:MessageID><ns3:MessagePrimaryContent xmlns:ns3="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/basic/1.1"><ns4:BreachRequest xmlns:ns4="urn://x-artefacts-gibdd-gov-ru/breach/root/1.0" Id="PERSONAL_SIGNATURE"><ns4:RequestedInformation><ns5:RegPointNum xmlns:ns5="urn://x-artefacts-gibdd-gov-ru/breach/commons/1.0">Т785ЕС57</ns5:RegPointNum></ns4:RequestedInformation><ns4:Governance><ns6:Name xmlns:ns6="urn://x-artefacts-gibdd-gov-ru/breach/commons/1.0">ГИБДД РФ</ns6:Name><ns7:Code xmlns:ns7="urn://x-artefacts-gibdd-gov-ru/breach/commons/1.0">GIBDD</ns7:Code><ns8:OfficialPerson xmlns:ns8="urn://x-artefacts-gibdd-gov-ru/breach/commons/1.0"><ns9:FamilyName xmlns:ns9="urn://x-artefacts-smev-gov-ru/supplementary/commons/1.0.1">Загурский</ns9:FamilyName><ns10:FirstName xmlns:ns10="urn://x-artefacts-smev-gov-ru/supplementary/commons/1.0.1">Андрей</ns10:FirstName><ns11:Patronymic xmlns:ns11="urn://x-artefacts-smev-gov-ru/supplementary/commons/1.0.1">Петрович</ns11:Patronymic></ns8:OfficialPerson></ns4:Governance></ns4:BreachRequest></ns3:MessagePrimaryContent><ns2:TestMessage></ns2:TestMessage></ns2:SenderProvidedRequestData><ns2:CallerInformationSystemSignature><ns12:Signature xmlns:ns12="http://www.w3.org/2000/09/xmldsig#"><ns12:SignedInfo><ns12:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ns12:CanonicalizationMethod><ns12:SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#gostr34102001-gostr3411"></ns12:SignatureMethod><ns12:Reference URI="#SIGNED_BY_CONSUMER"><ns12:Transforms><ns12:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ns12:Transform><ns12:Transform Algorithm="urn://smev-gov-ru/xmldsig/transform"></ns12:Transform></ns12:Transforms><ns12:DigestMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#gostr3411"></ns12:DigestMethod><ns12:DigestValue>/jXl70XwnttJB5sSokwh8SaVHwo2gjgILSu0qBaLUAo=</ns12:DigestValue></ns12:Reference></ns12:SignedInfo><ns12:SignatureValue>J3746ks34pOcPGQpKzc0sz3n9+gjPtzZbSEEs4c3sTwbtfdaY7N/hxXzEIvXc+3ad9bc35Y8yBhZ/BYbloGt+Q==</ns12:SignatureValue><ns12:KeyInfo><ns12:X509Data><ns12:X509Certificate>MIIBcDCCAR2gAwIBAgIEHVmVKDAKBgYqhQMCAgMFADAtMRAwDgYDVQQLEwdTWVNURU0xMQwwCgYDVQQKEwNJUzIxCzAJBgNVBAYTAlJVMB4XDTE1MDUwNzEyMTUzMFoXDTE4MDUwNjEyMTUzMFowLTEQMA4GA1UECxMHU1lTVEVNMTEMMAoGA1UEChMDSVMyMQswCQYDVQQGEwJSVTBjMBwGBiqFAwICEzASBgcqhQMCAiMBBgcqhQMCAh4BA0MABEDoWGZlTUWD43G1N7TEm14+QyXrJWProrzoDoCJRem169q4bezFOUODcNooQJNg3PtAizkWeFcX4b93u8fpVy7RoyEwHzAdBgNVHQ4EFgQUaRG++MAcPZvK/E2vR1BBl5G7s5EwCgYGKoUDAgIDBQADQQCg25vA3RJL3kgcJhVOHA86vnkMAtZYr6HBPa7LpEo0HJrbBF0ygKk50app1lzPdZ5TtK2itfmNgTYiuQHX3+nE</ns12:X509Certificate></ns12:X509Data></ns12:KeyInfo></ns12:Signature></ns2:CallerInformationSystemSignature></ns2:SendRequestRequest></ns1:Body></ns1:Envelope>